9front-accounts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-27 Sun 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>managing accounts on 9front</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">managing accounts on 9front</h1>
<p>
this assumes you are using hjfs in a <a href="./9front-cpusetup.html">cpu setup</a> (ie with a fileserver
and auth). if you are using cwfs, you should be able to just replace
<code>/srv/hjfs.cmd</code> with <code>/srv/cwfs.cmd</code> for most of it.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. creating accounts</a>
<ul>
<li><a href="#org0000001">1.1. adding a user to a group</a></li>
</ul>
</li>
<li><a href="#org0000002">2. renaming users</a></li>
<li><a href="#org0000003">3. setup defaults</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> creating accounts</h2>
<div class="outline-text-2" id="text-1">
<pre class="example" id="org0000004">
echo newuser bob &gt;&gt; /srv/hjfs.cmd
</pre>
<p>
will create a user named <code>bob</code>
</p>

<p>
use <code>auth/keyfs</code> to mount the authentication database, then set a
password and enable the account
</p>

<pre class="example" id="org0000004">
auth/keyfs
auth/changeuser bob
auth/enable bob
</pre>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-08-27 Sun]</span></span>: mkf recommends filling in the email-related fields,
as some programs use them
</p>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> adding a user to a group</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example" id="org0000004">
echo newuser upas +bob &gt;&gt; /srv/hjfs.cmd
</pre>
<p>
will add <code>bob</code> to the <code>upas</code> group, which allows mail. the <code>adm</code> and
<code>sys</code> groups allow adding users and accessing system files
respectively. there is also <code>cron</code> for allowing recurring tasks.
</p>
</div>
</div>
</div>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">2.</span> renaming users</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org0000004">
echo newuser bob jane &gt;&gt; /srv/hjfs.cmd
</pre>

<p>
to rename <code>bob</code> to <code>jane</code>. you will also need to set a new password
for them in the auth server.
</p>

<pre class="example" id="org0000004">
auth/changeuser jane
</pre>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">3.</span> setup defaults</h2>
<div class="outline-text-2" id="text-3">
<p>
run <code>/sys/lib/newuser</code> as the new user to get the default profile and
stuff in your home directory
</p>
</div>
</div>
</div>
</body>
</html>